{"class_name": "Functional", "config": {"name": "Final_output", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_data"}, "name": "input_data", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_data_1"}, "name": "input_data_1", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "conv1d_120", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_120", "inbound_nodes": [[["input_data", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_125", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_125", "inbound_nodes": [[["input_data_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_48", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "name": "max_pooling1d_48", "inbound_nodes": [[["conv1d_120", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_50", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "name": "max_pooling1d_50", "inbound_nodes": [[["conv1d_125", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_121", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_121", "inbound_nodes": [[["max_pooling1d_48", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_126", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_126", "inbound_nodes": [[["max_pooling1d_50", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_49", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "name": "max_pooling1d_49", "inbound_nodes": [[["conv1d_121", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_51", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "name": "max_pooling1d_51", "inbound_nodes": [[["conv1d_126", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_122", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_122", "inbound_nodes": [[["max_pooling1d_49", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_127", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_127", "inbound_nodes": [[["max_pooling1d_51", 0, 0, {}]]]}, {"class_name": "UpSampling1D", "config": {"name": "up_sampling1d_48", "trainable": true, "dtype": "float32", "size": 2}, "name": "up_sampling1d_48", "inbound_nodes": [[["conv1d_122", 0, 0, {}]]]}, {"class_name": "UpSampling1D", "config": {"name": "up_sampling1d_50", "trainable": true, "dtype": "float32", "size": 2}, "name": "up_sampling1d_50", "inbound_nodes": [[["conv1d_127", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_123", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_123", "inbound_nodes": [[["up_sampling1d_48", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_128", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_128", "inbound_nodes": [[["up_sampling1d_50", 0, 0, {}]]]}, {"class_name": "UpSampling1D", "config": {"name": "up_sampling1d_49", "trainable": true, "dtype": "float32", "size": 2}, "name": "up_sampling1d_49", "inbound_nodes": [[["conv1d_123", 0, 0, {}]]]}, {"class_name": "UpSampling1D", "config": {"name": "up_sampling1d_51", "trainable": true, "dtype": "float32", "size": 2}, "name": "up_sampling1d_51", "inbound_nodes": [[["conv1d_128", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_124", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_124", "inbound_nodes": [[["up_sampling1d_49", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_129", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_129", "inbound_nodes": [[["up_sampling1d_51", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_24", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_24", "inbound_nodes": [[["conv1d_124", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_25", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_25", "inbound_nodes": [[["conv1d_129", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_24", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_25", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Concatenate", "inbound_nodes": [[["flatten_24", 0, 0, {}], ["flatten_25", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "final_model_output", "trainable": true, "dtype": "float32", "units": 300, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "final_model_output", "inbound_nodes": [[["Concatenate", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 150, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_25", "inbound_nodes": [[["final_model_output", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_26", "inbound_nodes": [[["dense_25", 0, 0, {}]]]}], "input_layers": [["input_data", 0, 0], ["input_data_1", 0, 0]], "output_layers": [["dense_26", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}